Question 1:

In [1]:
import pandas as pd

print(pd.__version__)

0.23.4

Question 2:

In [3]:
# importing Pandas & numpy 
import pandas as pd 
import numpy as np 
  
# numpy array 
data = np.array(['a', 'b', 'c', 'd', 'e']) 
  
# creating series 
s = pd.Series(data) 
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [4]:
# importing Pandas & numpy 
import pandas as pd 
import numpy as np 
  
# numpy array 
data = np.array(['a', 'b', 'c', 'd', 'e']) 
  
# creating series 
s = pd.Series(data, index =[1000, 1001, 1002, 1003, 1004]) 
print(s)

1000    a
1001    b
1002    c
1003    d
1004    e
dtype: object

Question 3:

In [5]:
import pandas as pd 


df = pd.DataFrame({'Roll Number': ['20CSE29', '20CSE49', '20CSE36', '20CSE44'], 
				'Name': ['Amelia', 'Sam', 'Dean', 'Jessica'], 
				'Marks In Percentage': [97, 90, 70, 82], 
				'Grade': ['A', 'A', 'C', 'B'], 
				'Subject': ['Physics', 'Physics', 'Physics', 'Physics']}) 

# Printing the dataframe 
df['index'] = df.index 
df

  Roll Number     Name  Marks In Percentage Grade  Subject  index
0     20CSE29   Amelia                   97     A  Physics      0
1     20CSE49      Sam                   90     A  Physics      1
2     20CSE36     Dean                   70     C  Physics      2
3     20CSE44  Jessica                   82     B  Physics      3

Question 4:

In [7]:
import seaborn as sb

In [9]:
print(sb.get_dataset_names())

C:\Users\Sumukha\Anaconda3\lib\site-packages\seaborn\utils.py:376: UserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("lxml"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 376 of the file C:\Users\Sumukha\Anaconda3\lib\site-packages\seaborn\utils.py. To get rid of this warning, pass the additional argument 'features="lxml"' to the BeautifulSoup constructor.

  gh_list = BeautifulSoup(http)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

In [10]:
df = sb.load_dataset('mpg')

In [11]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

# Question 5:
may be Australia (Kaggle)

Question 6:

In [3]:
import pandas as pd
pd.set_option('display.max_columns', None)
df = pd.read_csv("C:\\Users\\Sumukha\\Desktop\\Python\\Lets Upgrade\\USA_cars_datasets.csv")
print(list(df.columns))

['Unnamed: 0', 'price', 'brand', 'model', 'year', 'title_status', 'mileage', 'color', 'vin', 'lot', 'state', 'country', 'condition']

In [4]:
print("Number of rows: ", len(df))

Number of rows:  2499

In [5]:
print(df.head())

   Unnamed: 0  price      brand    model  year   title_status   mileage  \
0           0   6300     toyota  cruiser  2008  clean vehicle  274117.0
1           1   2899       ford       se  2011  clean vehicle  190552.0
2           2   5350      dodge      mpv  2018  clean vehicle   39590.0
3           3  25000       ford     door  2014  clean vehicle   64146.0
4           4  27700  chevrolet     1500  2018  clean vehicle    6654.0

    color                  vin        lot       state country      condition
0   black    jtezu11f88k007763  159348797  new jersey     usa   10 days left
1  silver    2fmdk3gc4bbb02217  166951262   tennessee     usa    6 days left
2  silver    3c4pdcgg5jt346413  167655728     georgia     usa    2 days left
3    blue    1ftfw1et4efc23745  167753855    virginia     usa  22 hours left
4     red    3gcpcrec2jg473991  167763266     florida     usa  22 hours left

In [6]:
from collections import Counter
def return_counter(data_frame, column_name, limit):
  print(dict(Counter(data_frame[column_name]
  .values).most_common(limit)))

return_counter(df, 'brand', 5)

{'ford': 1235, 'dodge': 432, 'nissan': 312, 'chevrolet': 297, 'gmc': 42}